xmlcf/Documents/ПродажаАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПродажаАктива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.АктивыОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссииУстановленаВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НКД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlcf/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходРасходДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/AccumulationRegisters/АктивыОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АктивыОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаАктива</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/Enums/ВидыОперацийПриходРасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходРасходДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПополнениеБрокерскогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводСБрокерскогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаАктива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеАктива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБрокера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xmlcf/Documents/ПродажаАктива/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Отказ = Ложь;	
	
	ПроверитьВозможностьПроведения(Отказ);	
	
	Если НЕ Отказ тогда
		ВыполнитьДвиженияПоРегистрам();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьВозможностьПроведения(Отказ)
	
	Движения.ОстаткиДенежныхСредств.Очистить();
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движения.Записать();
	
	Движения.АктивыОстатки.Очистить();
	Движения.АктивыОстатки.Записывать = Истина;
	Движения.Записать();

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивыОстаткиОстатки.Актив КАК Актив,
		|	АктивыОстаткиОстатки.Валюта КАК Валюта,
		|	АктивыОстаткиОстатки.Портфель КАК Портфель,
		|	АктивыОстаткиОстатки.СуммаОстаток КАК СуммаОстаток,
		|	АктивыОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.АктивыОстатки.Остатки(
		|			&Период,
		|			Портфель = &Портфель
		|				И Валюта = &Валюта
		|				И Актив = &Актив) КАК АктивыОстаткиОстатки";
	
	Запрос.УстановитьПараметр("Валюта", Актив.Валюта);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	Запрос.УстановитьПараметр("Актив", Актив);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоОстаток < Количество тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивыОстаткиОстатки.Актив КАК Актив,
		|	АктивыОстаткиОстатки.Валюта КАК Валюта,
		|	АктивыОстаткиОстатки.Портфель КАК Портфель,
		|	АктивыОстаткиОстатки.ДокументПартии КАК ДокументПартии,
		|	СУММА(АктивыОстаткиОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(АктивыОстаткиОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.АктивыОстатки.Остатки(
		|			&Период,
		|			Портфель = &Портфель
		|				И Актив = &Актив
		|				И Валюта = &Валюта) КАК АктивыОстаткиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	АктивыОстаткиОстатки.Валюта,
		|	АктивыОстаткиОстатки.Портфель,
		|	АктивыОстаткиОстатки.ДокументПартии,
		|	АктивыОстаткиОстатки.Актив";
	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("Валюта", ВалютаСделки);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОсталосьСписатьКоличество = Количество;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ОсталосьСписатьКоличество <> 0 Тогда
			Движения.АктивыОстатки.Записывать = Истина;
			Движение = Движения.АктивыОстатки.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			Движение.Портфель 		= Портфель;
			Движение.Актив 			= Актив;
			Движение.ДокументПартии = ВыборкаДетальныеЗаписи.ДокументПартии;			
			Движение.Валюта 		= ВалютаСделки;
			Движение.Сумма 			= ВыборкаДетальныеЗаписи.СуммаОстаток;
			Движение.Количество 	= ВыборкаДетальныеЗаписи.КоличествоОстаток;	
		КонецЕсли;
	КонецЦикла;
	

	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;;
	Движение.Период 	 = Дата;
	Движение.ВидОперации = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.ПродажаАктива;
	Движение.Портфель 	 = Портфель;
	Движение.Валюта 	 = ВалютаСделки;
	Движение.Сумма 		 = Сумма;
	
	Если СуммаКомиссии <> 0 тогда
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 	 = Дата;
		Движение.ВидОперации = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.КомиссияБрокера;		
		Движение.Портфель 	 = Портфель;		
		Движение.Валюта 	 = ВалютаСделки;
		Движение.Сумма 		 = СуммаКомиссии;
	КонецЕсли;
	
	Если НКД <> 0 тогда
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 = Дата;
		Движение.ВидОперации = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.НКД;		
		Движение.Портфель 	 = Портфель;		
		Движение.Валюта 	 = ВалютаСделки;
		Движение.Сумма 		 = НКД;
	КонецЕсли;
	
КонецПроцедуры
